In [28]:
from sqlalchemy import create_engine
from config import password, host
engine = create_engine(f'postgresql://postgres:{password}@localhost:{host}/employees_db')
connection = engine.connect()

In [32]:
import pandas as pd

In [34]:
emp_data = pd.read_sql("SELECT * FROM employees", connection)
emp_data.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001   7/25/1953    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  11/18/1954       Byong  Delgrande   F  1991-09-07
2   57444        e0002   1/30/1958       Berry       Babb   F  1992-03-21
3  421786        s0001   9/28/1957       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  10/28/1952  Abdelkader    Baumann   F  1991-01-18

In [37]:
salary_data = pd.read_sql("SELECT * FROM salaries", connection)
salary_data.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228